ws-antifraude/src/test/resources/examples/RedencionCBS.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:ValidationAF>
         <tem:xmlDocument><![CDATA[<AntiFraudBrokerMessage>
	<Header>
		<IPAddress></IPAddress>
		<Devicefingerprint></Devicefingerprint>
		<Channel>COM</Channel>
		<BusinessLine>LUKAS</BusinessLine>
	</Header>
	<TransactionDetails>
		<TransactionSourceCountry></TransactionSourceCountry>
		<ThirdPartyBooking></ThirdPartyBooking>
		<CurrencyType></CurrencyType>
		<PNR></PNR>
		<ReserveOffice></ReserveOffice>
		<Duration></Duration>
		<CopypasteTC></CopypasteTC>
		<CopypasteNameTH></CopypasteNameTH>
		<CopypasteBank></CopypasteBank>
		<CopypasteCVV></CopypasteCVV>
		<CopypasteEmail></CopypasteEmail>
		<EventDate></EventDate>
		<Flexible></Flexible>
		<Languaje></Languaje>
		<CorpCod></CorpCod>
		<CorpName></CorpName>
		<CorpStatus></CorpStatus>
		<TravelInsurance></TravelInsurance>
		<IdTransaccion></IdTransaccion>
	</TransactionDetails>
	<PaymentDetails>
		<PaymentCurrencyType></PaymentCurrencyType>
		<Total></Total>
		<AdditionalCharges></AdditionalCharges>
	</PaymentDetails>
	<CreditCardHolder>
		<ZipCode></ZipCode>
		<BillingStreet></BillingStreet>
		<BillingStreet2></BillingStreet2>
		<BillingCity></BillingCity>
		<BillingState></BillingState>
		<BillingCountry></BillingCountry>
		<DocumentType></DocumentType>
		<DocumentNumber></DocumentNumber>
		<FirstName></FirstName>
		<LastName></LastName>
		<BankRegisteredPhoneNumber></BankRegisteredPhoneNumber>
		<Email></Email>
		<AlternativePhone></AlternativePhone>
	</CreditCardHolder>
	<CreditCard>
		<IssuingBank></IssuingBank>
		<Number></Number>
		<ExpirationMonth></ExpirationMonth>
		<ExpirationYear></ExpirationYear>
		<Installment></Installment>
		<BIN></BIN>
	</CreditCard>
	<Flight>
		<PassengerCount></PassengerCount>
		<Type></Type>
		<From></From>
		<To></To>
		<Airlinecode></Airlinecode>
		<PassengerTotalAmount></PassengerTotalAmount>
	</Flight>
	<Passengers>
		<PassengerEge1></PassengerEge1>
		<PassengerEge2></PassengerEge2>
		<PassengerEge3></PassengerEge3>
		<OfficePhone></OfficePhone>
		<HomePhone></HomePhone>
	</Passengers>
</AntiFraudBrokerMessage>]]></tem:xmlDocument>
         <tem:flowId>4</tem:flowId>
         <tem:userId>ESBAvcom</tem:userId>
      </tem:ValidationAF>
   </soapenv:Body>
</soapenv:Envelope>