ws-antifraude/src/main/resources/templates/RedencionCBS.vm

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:ValidationAF>
         <tem:xmlDocument><![CDATA[$body]]></tem:xmlDocument>
         <tem:flowId>$!headers.workflow</tem:flowId>
         <tem:userId>$!headers.usuario</tem:userId>
      </tem:ValidationAF>
   </soapenv:Body>
</soapenv:Envelope>